{% extends 'base.html' %}

{% block content%}

<div class="jumbotron"><center>
  <label><img src="{{ url_for('static', filename='img/logo.png') }}" alt="IFNMG" height="100px"></a></label>  <p>
<!--  <label><h1><b>SASA</b></h1></label>--->
  <p class="lead"><h2>Sistema de Análise de Situações Acadêmicas</h2></p>

</center></div>
<p style="text-align: center;"><strong>Tecnologia em An&aacute;lise e Desenvolvimento de Sistemas</strong></p>
<p style="text-align: justify;">O Curso tem como objetivo geral a forma&ccedil;&atilde;o de recursos humanos para a automa&ccedil;&atilde;o dos sistemas de informa&ccedil;&atilde;o das organiza&ccedil;&otilde;es, com vistas a atender as necessidades do mercado de trabalho corrente. As necessidades que podem ser atendidas abrangem principalmente o desenvolvimento, implanta&ccedil;&atilde;o e gerenciamento de sistemas para uso em processos organizacionais, passando pela infraestrutura e manuten&ccedil;&atilde;o de sistemas.</p>
<p>- <strong>Nome do curso:</strong>&nbsp;An&aacute;lise e Desenvolvimento de Sistemas<br />- <strong>Modalidade:</strong> Presencial<br />- <strong>Tipo:</strong> Tecn&oacute;logo<br />- <strong>Habilita&ccedil;&atilde;o:</strong>&nbsp;Tecn&oacute;logo em An&aacute;lise e Desenvolvimento de Sistemas<br />- <strong>Ano de implanta&ccedil;&atilde;o:</strong> 2006<br />- <strong>Ato de autoriza&ccedil;&atilde;o:</strong>&nbsp;Resolu&ccedil;&atilde;o CD n&ordm; 003/2005 de 20/09/2005<br />- <strong>Total de vagas ofertadas anualmente:</strong> 60<br />- <strong>N&uacute;mero de vagas ofertadas por turma:</strong> 30<br />- <strong>Formas de acesso:</strong> SISU<br />- <strong>N&uacute;mero de vagas disponibilizadas:</strong> 100%SISU<br />- <strong>Periodicidade de ingresso:</strong>&nbsp;1&ordm; Semestre e 2&ordm; Semestre<br />- <strong>Turno de funcionamento:</strong> Integral<br />- <strong>Tempo para integraliza&ccedil;&atilde;o do curso:</strong> Limite M&iacute;nimo: 3 anos e Limite M&aacute;ximo: 4,5 anos<br />- <strong>Resultados obtidos nas &uacute;ltimas avalia&ccedil;&otilde;es realizadas pelo MEC:</strong> 3 (Nota da avalia&ccedil;&atilde;o in loco &ndash; SINAES; Nota do ENADE)</p>
<p>- Perfil do egresso (como consta no PPC)</p>
<p style="text-align: justify;">O Curso de Tecnologia em An&aacute;lise e Desenvolvimento de Sistemas do IFNMG &ndash; Campus Janu&aacute;ria prov&ecirc; uma forma&ccedil;&atilde;o que capacita o profissional para a automa&ccedil;&atilde;o dos sistemas de informa&ccedil;&atilde;o das&nbsp;organiza&ccedil;&otilde;es, com vistas a atender as necessidades do mercado de trabalho corrente. As necessidades que podem ser atendidas abrangem o desenvolvimento, implanta&ccedil;&atilde;o e gerenciamento de sistemas e infraestrutura para uso em processos organizacionais, nas variadas necessidades expostas pelo mercado.<br />O curso deve prover uma forma&ccedil;&atilde;o que capacite o profissional para a solu&ccedil;&atilde;o de problemas do&nbsp;mundo real, por meio da an&aacute;lise e constru&ccedil;&atilde;o de modelos computacionais e de sua implementa&ccedil;&atilde;o.<br />O tecn&oacute;logo egresso deve ter condi&ccedil;&otilde;es de assumir um papel de agente transformador do&nbsp;mercado, sendo capaz de analisar as linguagens de computador e os c&oacute;digos de comunica&ccedil;&atilde;o entre o&nbsp;usu&aacute;rio e a m&aacute;quina, podendo empreender ou assumir chefia ou a organiza&ccedil;&atilde;o de Centro de Informa&ccedil;&otilde;es, tamb&eacute;m, trabalhar em tarefas espec&iacute;ficas, como documenta&ccedil;&atilde;o de sistemas e elabora&ccedil;&atilde;o de manuais, tendo como desafio provocar mudan&ccedil;as atrav&eacute;s da agrega&ccedil;&atilde;o de novas tecnologias na solu&ccedil;&atilde;o dos problemas e propiciando assim novos tipos de atividades.</p>


{% endblock %}
